### pandas

pandas is python library for reading,writing and analyze the data

it is best library for both data analysis and machine learning

pandas can be represented as 2 ways

* series   :1d array
* dataframe: 2d array

In [3]:
import pandas as pd


ayyo=pd.Series([1,2,3,4])
ayyo

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
vamo=pd.Series([2,3,4,5,6])
vamo

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [5]:
h=pd.Series([1,2,3,"okstring"])
h

0           1
1           2
2           3
3    okstring
dtype: object

In [6]:
type(h)

pandas.core.series.Series

In [9]:
a=pd.Series([10,20,30,40])
a[0]
a[1:]

1    20
2    30
3    40
dtype: int64

In [10]:
a=pd.Series([10,20,30,40,50,60,70,80])
a[1:5]

1    20
2    30
3    40
4    50
dtype: int64

### Data Frame

In [11]:
l=[10,20,30,40,50]
s=pd.DataFrame(l)
s

    0
0  10
1  20
2  30
3  40
4  50

In [12]:
s=pd.DataFrame([[1,2],[3,4],[5,6],[7,8]])
s

   0  1
0  1  2
1  3  4
2  5  6
3  7  8

In [14]:
s=pd.DataFrame([[1,2],[3,4],[5,6],[7,8]],columns=["one","two"])
s

   one  two
0    1    2
1    3    4
2    5    6
3    7    8

In [15]:
# convert the dictionary data into dataframe
d={"name":["a","b","c","d"],"age":[30,29,18,30],"marks":[80,85,90,95]}
d

{'name': ['a', 'b', 'c', 'd'],
 'age': [30, 29, 18, 30],
 'marks': [80, 85, 90, 95]}

In [16]:
d={"name":["a","b","c","d"],"age":[30,29,18,30],"marks":[80,85,90,95]}
df=pd.DataFrame(d)
df

  name  age  marks
0    a   30     80
1    b   29     85
2    c   18     90
3    d   30     95

In [17]:
# how to read the data from data fram

In [18]:
df['name']

0    a
1    b
2    c
3    d
Name: name, dtype: object

In [19]:
n=df['name']
type(n)

pandas.core.series.Series

In [20]:
nn=df[['name']]
nn

  name
0    a
1    b
2    c
3    d

In [21]:
type(nn)

pandas.core.frame.DataFrame

In [22]:
nn=df[['name','age']]
nn

  name  age
0    a   30
1    b   29
2    c   18
3    d   30

In [23]:
df[:]

  name  age  marks
0    a   30     80
1    b   29     85
2    c   18     90
3    d   30     95

In [24]:
df[2:]

  name  age  marks
2    c   18     90
3    d   30     95

In [25]:
df[1:4]

  name  age  marks
1    b   29     85
2    c   18     90
3    d   30     95

In [27]:
#read the data using loc and iloc

In [28]:
df

  name  age  marks
0    a   30     80
1    b   29     85
2    c   18     90
3    d   30     95

In [30]:
df.loc[0]

name      a
age      30
marks    80
Name: 0, dtype: object

In [31]:
df.loc[2:]

  name  age  marks
2    c   18     90
3    d   30     95

In [32]:
df.loc[2:,:"age"]

  name  age
2    c   18
3    d   30

In [34]:
df.loc[0:,"age":]

   age  marks
0   30     80
1   29     85
2   18     90
3   30     95

In [36]:
df.set_index('name')

      age  marks
name
a      30     80
b      29     85
c      18     90
d      30     95

In [37]:
df

  name  age  marks
0    a   30     80
1    b   29     85
2    c   18     90
3    d   30     95

In [45]:
df.set_index('name',inplace=True)
df

KeyError: 'name'

In [46]:
df

      age  marks
name
a      30     80
b      29     85
c      18     90
d      30     95